<a href="https://colab.research.google.com/github/Thanawich-Pinprayoon/INTRODUCTION-TO-DATA-ANALYTICS/blob/main/DA_HW_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##ฝึกมือกันหน่อยครับ !!!

จาก dataset ต่อไปนี้

https://docs.google.com/spreadsheets/u/1/d/e/2PACX-1vRIFbIywXecgxN5c1sMn_KYWsARoXgp4paFxu4qndPaX_47vRaOdrqmiHjtNZ9ZYQcv3ubMSv8DA9ta/pub?gid=1546938151&single=true (Links to an external site.)

 

จงพิมพ์ code ส่งตามคำสั่งต่อไปนี้ (ให้ copy โจทย์ด้วย)
โดยที่ ตัวแปรของ dataframe นี้คือ df 
ให้ใช้ library เพียง numpy กับ pandas เท่านั้น

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame( #ใช้ CSV PATH จากลิ้งค์กะได้
                            {
                            'eid':['E011','E012','E013','E014','E015','E016','E017','E018'],
                            'Name':['Anda','Bordin','Chantana','Donlaya','Ekkasit','Fundee','Gitiwit','Harit'],
                            'gender':['female','male','female','female','male','female','male','male'],
                            'department':['developer','developer','developer','marketing','marketing','support','support','devops'],
                            'age':[39,25,29,39,37,35,26,32],
                            'salary':[64200.00,48700.00,45500.00,72600.00,80500.00,56600.00,42400.00,67700.00],
                            'working_years':[4,2,3,8,7,3,2,5],
                            'birth_place':['Bangkok','Phuket','Chonburi','Chonburi','Suphanburi','Phuket','Suphanburi','Bangkok']
                            }
                          )

In [ ]:
df

    eid      Name  gender department  age   salary  working_years birth_place
0  E011      Anda  female  developer   39  64200.0              4     Bangkok
1  E012    Bordin    male  developer   25  48700.0              2      Phuket
2  E013  Chantana  female  developer   29  45500.0              3    Chonburi
3  E014   Donlaya  female  marketing   39  72600.0              8    Chonburi
4  E015   Ekkasit    male  marketing   37  80500.0              7  Suphanburi
5  E016    Fundee  female    support   35  56600.0              3      Phuket
6  E017   Gitiwit    male    support   26  42400.0              2  Suphanburi
7  E018     Harit    male     devops   32  67700.0              5     Bangkok

#จงสร้างคอลัมภ์ "extra_salary" เพื่อเพิ่มเงินเดือนให้แต่ละแผนก
โดย ถ้าเป็น developer ให้ คูณ 0.2, แต่แผนกอื่นให้คูณ 0.5
ให้ใช้เฉพาะคำสั่ง apply กับ lambda เท่านั้น

In [ ]:
df['extra_salary'] = df.apply(lambda x: x['salary']*0.2 if x['department'] is  'developer' else x['salary']*0.5,axis=1)

In [ ]:
df["extra_salary"] = df['salary']*df['department'].apply(lambda x: 0.2 if x == 'developer' else 0.5)

In [ ]:
if x == 'developer':
  return 0.2
else:
  return 0.5

In [ ]:
df

    eid      Name  gender  ... birth_place  extra_salary  name_with_age
0  E011      Anda  female  ...     Bangkok       12840.0       Anda(39)
1  E012    Bordin    male  ...      Phuket        9740.0     Bordin(25)
2  E013  Chantana  female  ...    Chonburi        9100.0   Chantana(29)
3  E014   Donlaya  female  ...    Chonburi       36300.0    Donlaya(39)
4  E015   Ekkasit    male  ...  Suphanburi       40250.0    Ekkasit(37)
5  E016    Fundee  female  ...      Phuket       28300.0     Fundee(35)
6  E017   Gitiwit    male  ...  Suphanburi       21200.0    Gitiwit(26)
7  E018     Harit    male  ...     Bangkok       33850.0      Harit(32)

[8 rows x 10 columns]

In [ ]:
df.tail(1).index[-1]

7

#จงหาจำนวน sample ของข้อมูลชุดนี้ (จำนวน rows)

In [ ]:
len(df)

8

In [ ]:
int(df.size)

72

In [ ]:
df.shape[0]

8

In [ ]:
type(df.shape)

tuple

In [ ]:
int(float(df.size)//float(df.shape[1]))

8

#จงสร้างคอลัมภ์ "name_with_age" ให้แสดงผลเป็น ชื่อ วงเล็บอายุ เช่น "Anda (39)"
โดยห้ามใช้ apply กับ lambda เด็ดขาด

In [ ]:
df['name_with_age'] = df['Name']+'(' + df['age'].map(str) + ')'

In [ ]:
df['name_with_age'] = df['name']+str("(")+df['age'].astype(str)+str(")")

In [ ]:
df

    eid      Name  gender  ... birth_place  extra_salary  name_with_age
0  E011      Anda  female  ...     Bangkok       12840.0       Anda(39)
1  E012    Bordin    male  ...      Phuket        9740.0     Bordin(25)
2  E013  Chantana  female  ...    Chonburi        9100.0   Chantana(29)
3  E014   Donlaya  female  ...    Chonburi       36300.0    Donlaya(39)
4  E015   Ekkasit    male  ...  Suphanburi       40250.0    Ekkasit(37)
5  E016    Fundee  female  ...      Phuket       28300.0     Fundee(35)
6  E017   Gitiwit    male  ...  Suphanburi       21200.0    Gitiwit(26)
7  E018     Harit    male  ...     Bangkok       33850.0      Harit(32)

[8 rows x 10 columns]

#จงหาว่า แผนกใดที่ให้เงินเดือนเฉลี่ยของผู้หญิงสูงที่สุด

In [ ]:
df2 = pd.DataFrame({'col1': [np.array([[1.,3.],[4.,2.]]), np.array([[1.,1.],[3.,2.]])],
                   'col2': [np.array([[1.,3.],[3.,3.]]), np.array([[2.,3.],[3.,1.]])]})

In [ ]:
df2

                       col1                      col2
0  [[1.0, 3.0], [4.0, 2.0]]  [[1.0, 3.0], [3.0, 3.0]]
1  [[1.0, 1.0], [3.0, 2.0]]  [[2.0, 3.0], [3.0, 1.0]]

In [ ]:
df

    eid      Name  gender  ... birth_place  extra_salary  name_with_age
0  E011      Anda  female  ...     Bangkok       12840.0       Anda(39)
1  E012    Bordin    male  ...      Phuket        9740.0     Bordin(25)
2  E013  Chantana  female  ...    Chonburi        9100.0   Chantana(29)
3  E014   Donlaya  female  ...    Chonburi       36300.0    Donlaya(39)
4  E015   Ekkasit    male  ...  Suphanburi       40250.0    Ekkasit(37)
5  E016    Fundee  female  ...      Phuket       28300.0     Fundee(35)
6  E017   Gitiwit    male  ...  Suphanburi       21200.0    Gitiwit(26)
7  E018     Harit    male  ...     Bangkok       33850.0      Harit(32)

[8 rows x 10 columns]

In [ ]:
df[df['gender'] == 'female'].groupby('department').mean().sort_values(by='salary',ascending=False).reset_index().loc[0].department

'marketing'

In [ ]:
df[(df['gender']=='female')][['salary','department']].groupby(['department']).mean().reset_index().sort_values(by='salary').tail(1).department

1    marketing
Name: department, dtype: object

In [ ]:
df[df['gender'] == 'female']

    eid      Name  gender  ... working_years  birth_place  extra_salary
0  E011      Anda  female  ...             4      Bangkok       12840.0
2  E013  Chantana  female  ...             3     Chonburi        9100.0
3  E014   Donlaya  female  ...             8     Chonburi       36300.0
5  E016    Fundee  female  ...             3       Phuket       28300.0

[4 rows x 9 columns]

In [ ]:
df[df['gender'] == 'female'].groupby('department').mean().sort_values(by='salary',ascending=False).reset_index().loc[0].department

'marketing'

In [ ]:
df['gender'] == 'female'

0     True
1    False
2     True
3     True
4    False
5     True
6    False
7    False
Name: gender, dtype: bool

In [ ]:
df[df['gender'] == 'female'].groupby('department').agg('mean').reset_index().max()

department       support
age                   39
salary             72600
working_years          8
extra_salary       36300
dtype: object

#จงหาชื่อแผนกทั้งหมด
แสดงเป็น list โดยไม่ซ้ำกัน ด้วยฟังก์ชั่นที่มีของ pandas

In [ ]:
df.department.unique().tolist()

['developer', 'marketing', 'support', 'devops']

In [ ]:
df['department'].unique().tolist()

['developer', 'marketing', 'support', 'devops']